
<!-- 修改價格 -->
UPDATE products
SET price = 180
WHERE id = 3;

<!-- 修改庫存 -->
UPDATE products
SET stock = 25
WHERE id = 5;

-- 查詢所有產品以確認修改結果
SELECT
  id,
  name,
  price,
  stock
FROM products
ORDER BY id;

-- 更新所有庫存
UPDATE products p
SET stock = v.stock
FROM (VALUES
(1,0),
(2,0),
(3,0),
(4,0),
(5,0),
(6,0),
(7,0),
(8,0),
(9,0),
(10,16),
(11,5),
(12,13),
(13,8),
(14,9),
(15,2),
(16,21),
(17,20),
(18,13),
(19,5),
(20,4),
(21,11),
(22,8),
(23,23),
(24,0),
(25,3),
(26,3),
(27,2),
(28,5),
(29,9),
(30,2),
(31,7),
(32,7),
(33,4),
(34,6),
(35,4),
(36,6),
(37,19),
(38,20),
(39,23),
(40,18),
(41,0),
(42,1),
(43,6),
(44,0),
(45,1)
) AS v(id, stock)
WHERE p.id = v.id;